In [1]:
import pandas as pd

In [ ]:
df_product=pd.read_csv('product_info.csv')
df_sales=pd.read_csv('retail_sales.csv')
df_store=pd.read_csv('store_details.csv')

In [14]:
df_product.head
df_product.info()
df_product.isnull().sum()

#No missing values found. Hence, handling of missing values is not necessary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    10 non-null     int64
 1   Product_Name  10 non-null     object
 2   Category      10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

Product_ID      0
Product_Name    0
Category        0
dtype: int64

In [15]:
df_sales.head
df_sales.info()
df_sales.isnull().sum()

#No missing values found. Hence, handling of missing values is not necessary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    500 non-null    int64
 1   Transaction_Date  500 non-null    object
 2   Product_ID        500 non-null    int64
 3   Store_ID          500 non-null    int64
 4   Quantity          500 non-null    int64
 5   Unit_Price        500 non-null    float64
dtypes: float64(1), int64(4), object(1)
memory usage: 23.6+ KB

Transaction_ID      0
Transaction_Date    0
Product_ID          0
Store_ID            0
Quantity            0
Unit_Price          0
dtype: int64

In [16]:
df_store.head
df_store.info()
df_store.isnull().sum()

#No missing values found. Hence, handling of missing values is not necessary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Store_ID    10 non-null     int64
 1   Store_Name  10 non-null     object
 2   Country     10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

Store_ID      0
Store_Name    0
Country       0
dtype: int64

In [13]:
df_product.drop_duplicates(inplace=True)
df_sales.drop_duplicates(inplace=True)
df_store.drop_duplicates(inplace=True)

In [17]:
df_product.describe()

       Product_ID
count    10.00000
mean   1004.50000
std       3.02765
min    1000.00000
25%    1002.25000
50%    1004.50000
75%    1006.75000
max    1009.00000

In [18]:
df_sales.describe()

       Transaction_ID   Product_ID    Store_ID    Quantity  Unit_Price
count      500.000000   500.000000  500.000000  500.000000  500.000000
mean       250.500000  1004.430000    5.466000   10.064000   52.479500
std        144.481833     2.941156    2.885393    5.520585   26.176497
min          1.000000  1000.000000    1.000000    1.000000    5.030000
25%        125.750000  1002.000000    3.000000    5.000000   29.372500
50%        250.500000  1004.000000    5.000000   10.000000   54.230000
75%        375.250000  1007.000000    8.000000   15.000000   73.822500
max        500.000000  1009.000000   10.000000   19.000000   99.570000

In [19]:
df_store.describe()

       Store_ID
count  10.00000
mean    5.50000
std     3.02765
min     1.00000
25%     3.25000
50%     5.50000
75%     7.75000
max    10.00000

In [ ]:
#Left join used to ensure that all transactions are maintained and are linked to the suitable product details
df_combined=pd.merge(df_sales, df_product,how='left')
df_combined.head

<bound method NDFrame.head of      Transaction_ID Transaction_Date  Product_ID  Store_ID  Quantity  \
0                 1       2023-11-24        1006         9         1
1                 2       2023-02-27        1003         1        15
2                 3       2023-01-13        1007         1         8
3                 4       2023-05-21        1004         4        11
4                 5       2023-05-06        1006         9        12
..              ...              ...         ...       ...       ...
495             496       2023-12-14        1000        10        15
496             497       2023-10-02        1006        10        11
497             498       2023-06-19        1006         8         2
498             499       2023-01-15        1008         2        15
499             500       2023-03-01        1002         9        14

     Unit_Price  Product_Name     Category
0         26.86  Product_1006  Electronics
1         17.48  Product_1003    Groceries
2         87.47  Product_1007  Electronics
3         96.51  Product_1004  Electronics
4          7.97  Product_1006  Electronics
..          ...           ...          ...
495       23.22  Product_1000    Groceries
496       25.12  Product_1006  Electronics
497       51.04  Product_1006  Electronics
498       76.65  Product_1008     Clothing
499       63.85  Product_1002    Groceries

[500 rows x 8 columns]>

In [ ]:
#Left join used to ensure that all transactions are maintained and are linked to the suitable store details
df_combined=pd.merge(df_combined, df_store,how='left')
df_combined.head

<bound method NDFrame.head of      Transaction_ID Transaction_Date  Product_ID  Store_ID  Quantity  \
0                 1       2023-11-24        1006         9         1
1                 2       2023-02-27        1003         1        15
2                 3       2023-01-13        1007         1         8
3                 4       2023-05-21        1004         4        11
4                 5       2023-05-06        1006         9        12
..              ...              ...         ...       ...       ...
495             496       2023-12-14        1000        10        15
496             497       2023-10-02        1006        10        11
497             498       2023-06-19        1006         8         2
498             499       2023-01-15        1008         2        15
499             500       2023-03-01        1002         9        14

     Unit_Price  Product_Name     Category Store_Name Country
0         26.86  Product_1006  Electronics    Store_9      UK
1         17.48  Product_1003    Groceries    Store_1  Canada
2         87.47  Product_1007  Electronics    Store_1  Canada
3         96.51  Product_1004  Electronics    Store_4  Canada
4          7.97  Product_1006  Electronics    Store_9      UK
..          ...           ...          ...        ...     ...
495       23.22  Product_1000    Groceries   Store_10  Canada
496       25.12  Product_1006  Electronics   Store_10  Canada
497       51.04  Product_1006  Electronics    Store_8     USA
498       76.65  Product_1008     Clothing    Store_2  Canada
499       63.85  Product_1002    Groceries    Store_9      UK

[500 rows x 10 columns]>

In [27]:
df_combined['Total Sale']=df_combined['Quantity']*df_combined['Unit_Price']
print(df_combined['Quantity'],df_combined['Unit_Price'],df_combined['Total Sale'])

0       1
1      15
2       8
3      11
4      12
       ..
495    15
496    11
497     2
498    15
499    14
Name: Quantity, Length: 500, dtype: int64 0      26.86
1      17.48
2      87.47
3      96.51
4       7.97
       ...
495    23.22
496    25.12
497    51.04
498    76.65
499    63.85
Name: Unit_Price, Length: 500, dtype: float64 0        26.86
1       262.20
2       699.76
3      1061.61
4        95.64
        ...
495     348.30
496     276.32
497     102.08
498    1149.75
499     893.90
Name: Total Sale, Length: 500, dtype: float64

In [33]:
df_combined['Transaction']=pd.to_datetime(df_combined['Transaction_Date'])
df_combined['Year']=df_combined['Transaction'].dt.year
df_combined['Month']=df_combined['Transaction'].dt.month
df_combined['Day']=df_combined['Transaction'].dt.day

In [35]:
df_combined.dtypes

Transaction_ID               int64
Transaction_Date            object
Product_ID                   int64
Store_ID                     int64
Quantity                     int64
Unit_Price                 float64
Product_Name                object
Category                    object
Store_Name                  object
Country                     object
Total Sale                 float64
Transaction         datetime64[ns]
Year                         int32
Month                        int32
Day                          int32
dtype: object

In [ ]:
print(df_combined.groupby("Country")[['Total Sale']])

<bound method GroupBy.mean of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000011E092F5F90>>

In [44]:
print(df_combined.groupby("Country")[['Quantity']].mean)

<bound method GroupBy.mean of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000011E08171CD0>>

In [42]:
print(df_combined.groupby("Country")[['Transaction_ID']].value_counts)

<bound method DataFrameGroupBy.value_counts of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000011E08C79150>>

In [43]:
df_combined.to_csv('final_sales_data.csv')

In [47]:
#Function to Return top 5 products by country
def top_5_products_by_country(df):
    n=5

    product_sales_per_country=df.groupby(['Country', 'Product_ID'])['Total Sale'].sum().reset_index()
    product_sales_per_country = product_sales_per_country.sort_values(
        by=['Country', 'Total Sale'], ascending=[True, False]
    )
    top_n_products = product_sales_per_country.groupby('Country').head(n)

    return top_n_products

In [48]:
top_5_products_by_country(df_combined)

   Country  Product_ID  Total Sale
1   Canada        1001    15729.05
6   Canada        1006    15256.10
7   Canada        1007    14632.13
0   Canada        1000    14488.78
4   Canada        1004    13562.32
10      UK        1000     4162.93
12      UK        1002     3267.72
19      UK        1009     2707.08
18      UK        1008     2296.36
14      UK        1004     2293.45
22     USA        1002    18777.45
27     USA        1007    14746.72
23     USA        1003    13986.37
26     USA        1006    13639.66
24     USA        1004    12851.42